{
  "backend/main.mo": "Main Motoko actor defining user preferences, profiles, C Coins balances, and purchased visual effects with CRUD operations, access-control enforcement, and blob storage mixin included.",
  "feature_evidence.json": "Feature evidence report listing two completed features: removing the Secret tab from the app and fixing the Click Me button in MusicTab to correctly call addCCoins and update the balance.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the project's frontend components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the UI.",
  "frontend/index.html": "Minimal HTML entry point titled 'Colt UI' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that manages global preference state (accent color, cursor, background, font, tab cloak), loads/saves preferences via React Query hooks, applies font globally, and renders all tab components except the removed Secret tab.",
  "frontend/src/components/AnimatedBackground.tsx": "Canvas-based animated background component supporting six animated styles (Particle Grid, Neon Rain, Matrix Code, Starfield, Solid Dark, Cyber Hex Grid) and returning null for image-based background presets.",
  "frontend/src/components/CustomCursor.tsx": "Renders a custom animated cursor with multiple styles (neon dot, crosshair, ring pulse, star burst, arrow glow) that tracks mouse position with smooth interpolation and reacts to hover/click states.",
  "frontend/src/components/effects/FireworksOnClick.tsx": "Canvas-based effect that spawns colorful particle fireworks at the mouse position on each click, animating them with gravity and fade-out.",
  "frontend/src/components/effects/RainbowCursorTrail.tsx": "Canvas overlay that renders a rainbow-colored particle trail following the mouse cursor, with particles that fade, drift, and shrink over time.",
  "frontend/src/components/games/ColtAsteroids.tsx": "A canvas-based Asteroids clone with neon visuals, supporting keyboard controls for ship movement/shooting, progressive difficulty levels, lives, and score tracking.",
  "frontend/src/components/games/ColtBreakout.tsx": "A canvas-based Breakout/Arkanoid clone with neon visuals, mouse and keyboard paddle control, multi-row colored bricks, lives, score, and win/lose states.",
  "frontend/src/components/games/ColtPong.tsx": "A Pong game component rendered on an HTML5 canvas with a player-controlled paddle (keyboard/mouse) versus a CPU opponent, featuring neon cyberpunk visuals and score tracking.",
  "frontend/src/components/games/ColtRacer.tsx": "A lane-based endless racer game rendered on canvas where the player dodges colored obstacle cars across 5 lanes using keyboard or click input, with increasing speed and a best-score tracker.",
  "frontend/src/components/games/ColtTetris.tsx": "A Tetris implementation rendered on an HTML5 canvas with standard tetrominoes, ghost piece, line-clear scoring, and increasing speed, styled with a neon cyberpunk aesthetic.",
  "frontend/src/components/games/FlappyColt.tsx": "A Flappy Bird clone rendered on canvas where the player taps/presses space to flap a glowing bird through procedurally generated pipe gaps, with score and best-score display.",
  "frontend/src/components/games/SnakeGame.tsx": "A classic Snake game rendered on an HTML5 canvas with a neon cyberpunk theme, interval-based movement, food spawning, collision detection, and best-score tracking.",
  "frontend/src/components/GlassCard.tsx": "A reusable glassmorphism card component with optional hover effects and neon color variants (cyan, green, purple, pink).",
  "frontend/src/components/Header.tsx": "Sticky navigation header displaying the Colt UI logo, tab navigation (Games, Proxy, Music, AI, Store, More), optional VIP badge, and an online status indicator.",
  "frontend/src/components/tabs/ColtAITab.tsx": "A chat interface tab for 'Colt AI', a study assistant that responds to user messages about Math, History, English, and Science using a local `respondToMessage` utility, with subject shortcut buttons and auto-scrolling message history.",
  "frontend/src/components/tabs/GamesTab.tsx": "An arcade games tab that displays a grid of 7 available mini-games (Flappy Colt, Snake, Pong, Tetris, Breakout, Asteroids, Racer) and renders the selected game component with a back button.",
  "frontend/src/components/tabs/MoreTab.tsx": "A settings/customization tab that allows users to change accent color, cursor style, background style, font style, and tab cloak preset, persisting preferences via backend hooks.",
  "frontend/src/components/tabs/MusicTab.tsx": "A music search tab that queries Invidious API instances to find YouTube videos, embeds a player for the selected result, and includes a button to claim infinite C Coins via the backend actor.",
  "frontend/src/components/tabs/ProxyTab.tsx": "A browser proxy tab that loads user-entered URLs in an iframe, with a compact active URL bar, quick links, loading/error states, and a clear button.",
  "frontend/src/components/tabs/SecretTab.tsx": "An empty file with no content.",
  "frontend/src/components/tabs/StoreTab.tsx": "Renders a C Coin store UI where users can browse and purchase visual effects/badges using their C Coin balance, with items defined as a static list and purchase state managed via React Query mutations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login/logout flows, and persisting identity state across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks for backend interactions including preferences, notepad, C Coins (get/add/spend), and purchased effects (get/set).",
  "frontend/src/index.css": "Global stylesheet that sets up CSS variables, Tailwind imports, glassmorphism styles, custom fonts, animations (glitch, neon pulse, float), and purchased-effect CSS classes like golden borders and glitch text.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/utils/coltAI.ts": "Implements a keyword-based AI assistant with hardcoded Q&A datasets covering history and science topics for offline question answering.",
  "frontend/src/utils/tabCloak.ts": "Defines tab cloaking presets (Google, YouTube, Clever, etc.) and a utility function to change the browser tab title and favicon to disguise the app.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a cyberpunk/neon theme with custom fonts, neon colors, box shadows, animations (pulse, float, glitch), and CSS variable-based semantic color tokens.",
  "project_state.json": "Project state manifest for 'Colt UI' (version 23) describing existing features, known issues, architectural notes, and a summary of the app's cyberpunk-themed tabbed web interface with proxy, games, music, AI, and store tabs."
}