{
  "backend/main.mo": "Motoko actor that stores per-user preferences (tab, accent color, notepad) and user profiles in maps, with authorization checks using AccessControl/MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting the addition of 5 new canvas-based browser games (Pong, Tetris, Breakout, Asteroids, Racer) to GamesTab.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the project's frontend components and hooks.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point titled 'Colt UI' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component managing active tab state, accent color theming with CSS variable injection, backend preference persistence, and animated tab transitions across Games/Proxy/Music/More tabs.",
  "frontend/src/components/AnimatedBackground.tsx": "Fixed canvas component that renders a subtle grid, 60 floating neon particles with glow effects, and connecting lines between nearby particles as an animated backdrop.",
  "frontend/src/components/CustomCursor.tsx": "Custom cursor overlay with a neon dot, smoothly trailing ring, and subtle trail dot that change color and scale on hover over interactive elements or mouse clicks.",
  "frontend/src/components/games/ColtAsteroids.tsx": "A canvas-based Asteroids clone with neon visuals, featuring ship movement, bullet shooting, asteroid spawning/splitting, lives, scoring, and level progression.",
  "frontend/src/components/games/ColtBreakout.tsx": "A canvas-based Breakout/Arkanoid clone with neon aesthetics, supporting mouse and keyboard paddle control, brick destruction, lives, scoring, and win/lose states.",
  "frontend/src/components/games/ColtPong.tsx": "A canvas-based Pong game with neon visuals where the player competes against a CPU opponent, supporting mouse and keyboard controls with score tracking.",
  "frontend/src/components/games/ColtRacer.tsx": "A canvas-based lane-switching endless racer game with neon car graphics, obstacle spawning, increasing speed, and keyboard/click controls.",
  "frontend/src/components/games/ColtTetris.tsx": "A canvas-based Tetris clone with neon-colored tetrominoes, ghost piece preview, line clearing, progressive speed increase, and score/best-score tracking.",
  "frontend/src/components/games/FlappyColt.tsx": "A Flappy Bird-style canvas game with a cyberpunk neon aesthetic, featuring a bird that flaps through pipes with gravity physics, score tracking, and keyboard/click controls.",
  "frontend/src/components/games/SnakeGame.tsx": "A classic Snake game rendered on an HTML canvas with a neon grid aesthetic, supporting keyboard direction controls, food spawning, collision detection, and score/best-score tracking.",
  "frontend/src/components/GlassCard.tsx": "A reusable React card component with a glassmorphism style, supporting optional hover effects with neon color variants (cyan, green, purple, pink).",
  "frontend/src/components/Header.tsx": "App header component displaying the COLT UI logo, tab navigation (Games, Proxy, Music, More), and an online status indicator with neon styling.",
  "frontend/src/components/tabs/GamesTab.tsx": "An arcade hub tab that displays a grid of seven available mini-games and renders the selected game component with a back-navigation header.",
  "frontend/src/components/tabs/MoreTab.tsx": "A settings/utilities tab providing accent color selection, keyboard shortcuts reference, a live clock with stopwatch widget, and a notepad with save functionality.",
  "frontend/src/components/tabs/MusicTab.tsx": "A music player tab that lists curated YouTube-embedded tracks by genre and displays an embedded player iframe when a track is selected.",
  "frontend/src/components/tabs/ProxyTab.tsx": "A browser-like tab component that loads URLs in an iframe with a URL bar, quick links, and error handling for sites that block embedding.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor, using an authenticated identity if available or falling back to anonymous, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions and identity state to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user preferences and notepad content via the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet defining a cyberpunk/neon design system with CSS custom properties, Tailwind layers, glass morphism utilities, neon glow effects, custom scrollbars, and keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback for sensitive values like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the Colt UI frontend, defining a dark cyberpunk theme with neon colors (cyan, green, purple, pink), custom fonts (Orbitron, Rajdhani), glassmorphism shadows, and animations like pulse-neon and grid-scroll.",
  "project_state.json": "Project state descriptor for Colt UI (version 7) documenting existing features including tabbed navigation, dark neon theme, custom cursor, web proxy iframe, Flappy Colt canvas game, Snake/Pong game, and a music tab with search functionality."
}