{
  "kind": "build_request",
  "title": "Remove Secret tab and fix Click Me button C Coins not updating Store balance",
  "projectName": "Colt UI",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-34",
      "text": "Remove the 'Secret' tab entirely from the application. Delete SecretTab.tsx, remove it from the tab list in Header.tsx, and remove its rendering from App.tsx. The tab should no longer appear in navigation or be accessible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "get rid of the code tab"
        ]
      },
      "acceptanceCriteria": [
        "The Secret/lock-icon tab no longer appears in the top navigation header",
        "Navigating to the Secret tab route or index is no longer possible",
        "SecretTab.tsx is removed or its reference is fully excised from App.tsx and Header.tsx",
        "All other tabs (Games, Proxy, Music, Colt AI, Store, More) continue to render correctly"
      ]
    },
    {
      "id": "REQ-35",
      "text": "Fix the 'Click Me' button in MusicTab.tsx so that clicking it successfully calls the addCCoins backend function with 999999999 and the updated C Coins balance is immediately reflected in the Store tab. Diagnose and resolve the root cause: ensure the useAddCCoins mutation hook is correctly wired in MusicTab.tsx, that it calls the backend actor's addCCoins method, and that on success it invalidates or refetches the getCCoins query so the balance displayed in StoreTab.tsx updates without requiring a page refresh.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "when i click the button on the music tab it does not add an infinite amount of coins to my balance one the store tab please fix this error"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the 'Click Me' button in the Music tab triggers a call to the backend addCCoins function with the value 999999999",
        "After the call succeeds, the C Coins balance in the Store tab updates to reflect the added coins without requiring a manual page refresh",
        "The neon success message ('Infinite C Coins Unlocked!' or equivalent) is displayed in the Music tab after a successful click",
        "The getCCoins query cache is invalidated or refetched on successful addCCoins mutation so the Store tab's balance display is in sync",
        "No console errors are thrown during the button click flow"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/ (immutable paths)",
    "Do not alter the backend C Coins data model or existing balance storage logic"
  ],
  "nonGoals": [
    "Adding any new tabs or features beyond removing the Secret tab",
    "Redesigning the Music tab layout or search functionality",
    "Changing how other tabs interact with the C Coins balance"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}