{
  "kind": "build_request",
  "title": "Redesign Proxy Tab with Google-style layout",
  "projectName": "Colt UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Redesign the Proxy tab (ProxyTab.tsx) to feature a centered Google-style landing layout when no URL is loaded. Display a prominent logo area in the center of the page: a neon-styled icon or emblem with the text 'Colt UI' displayed next to it (inline, on the same line). Below the logo, render a wide, prominent search/URL input bar styled like Google's search bar but matching the existing dark neon/cyberpunk aesthetic (glassmorphism, neon glow border on focus). The bar should include a 'Go' or submit button inline or beneath it. Once a URL is submitted and loaded, the iframe fills the tab content area as before, with the status bar showing the current proxied URL. The centered landing layout is only shown when no URL is currently loaded.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "could you give the proxy tab more like a google layout like a search bar underneath the logo and next to the logo says colt ui"
        ]
      },
      "acceptanceCriteria": [
        "When the Proxy tab has no active URL loaded, the tab displays a centered layout with a logo/emblem and 'Colt UI' text displayed inline next to it.",
        "A wide, prominent URL/search input bar is rendered below the logo, visually similar to Google's search bar but styled with the existing neon cyberpunk theme (glassmorphism card, neon glow on focus).",
        "Submitting a URL via the search bar loads the target URL in an iframe that fills the content area, consistent with the existing proxy behavior.",
        "A status bar showing the current proxied URL is visible when an iframe is loaded.",
        "The centered landing layout is hidden once a URL is actively loaded in the iframe.",
        "The design matches the existing dark neon/cyberpunk aesthetic used throughout Colt UI."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed under frontend.immutablePaths.",
    "Preserve all existing proxy iframe loading and error-handling logic; only change the layout and visual presentation."
  ],
  "nonGoals": [
    "Adding a real search engine integration or Google API calls.",
    "Changing the proxy iframe behavior or URL-fetching mechanism.",
    "Modifying any other tab (Games, Music, More).",
    "Backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}