{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Redesign Proxy Tab with Google-style layout",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Redesign the Proxy tab (ProxyTab.tsx) to feature a centered Google-style landing layout when no URL is loaded, with a prominent neon-styled logo/emblem displaying 'Colt UI' inline, and a wide URL input bar styled like Google's search bar but matching the dark neon/cyberpunk aesthetic. Once a URL is submitted, the iframe fills the tab as before.",
      "acceptanceCriteria": [
        "When the Proxy tab has no active URL loaded, the tab displays a centered layout with a logo/emblem and 'Colt UI' text displayed inline next to it.",
        "A wide, prominent URL/search input bar is rendered below the logo, visually similar to Google's search bar but styled with the existing neon cyberpunk theme (glassmorphism card, neon glow on focus).",
        "Submitting a URL via the search bar loads the target URL in an iframe that fills the content area, consistent with the existing proxy behavior.",
        "A status bar showing the current proxied URL is visible when an iframe is loaded.",
        "The centered landing layout is hidden once a URL is actively loaded in the iframe.",
        "The design matches the existing dark neon/cyberpunk aesthetic used throughout Colt UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/tabs/ProxyTab.tsx",
          "operation": "modify",
          "description": "Redesign the ProxyTab component to display a centered Google-style landing layout when no URL is loaded. Add a centered container with the generated logo image (frontend/public/assets/generated/colt-ui-logo.dim_400x100.png) and 'Colt UI' text displayed inline on the same line. Below the logo, render a wide, prominent URL input bar styled with glassmorphism and neon glow effects on focus, matching the existing dark neon/cyberpunk aesthetic. Include a 'Go' submit button inline with the input bar. Preserve all existing proxy iframe loading, URL state management, error handling, and quick links logic. When a URL is submitted and loaded, hide the centered landing layout and display the iframe with the status bar showing the current proxied URL as before. Use Tailwind utility classes and the existing CSS custom properties for theming consistency."
        }
      ]
    }
  ]
}