{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove Secret tab and fix Click Me button C Coins not updating Store balance",
  "requirements": [
    {
      "id": "REQ-34",
      "summary": "Remove the Secret tab entirely from the application including SecretTab.tsx, its route registration, and all navigation references",
      "acceptanceCriteria": [
        "The Secret/lock-icon tab no longer appears in the top navigation header",
        "Navigating to the Secret tab route or index is no longer possible",
        "SecretTab.tsx is removed or its reference is fully excised from App.tsx and Header.tsx",
        "All other tabs (Games, Proxy, Music, Colt AI, Store, More) continue to render correctly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Remove the Secret tab entry from the tabs array. Delete the object with icon Lock and label 'Secret' so it no longer appears in the navigation header."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the conditional rendering of SecretTab component. Delete the case where activeTab === 'secret' and remove the import statement for SecretTab."
        },
        {
          "path": "frontend/src/components/tabs/SecretTab.tsx",
          "operation": "delete",
          "description": "Delete the entire SecretTab.tsx file as it is no longer needed and should not be accessible."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Fix the Click Me button in MusicTab.tsx so clicking it calls addCCoins(999999999) and immediately updates the Store tab balance via query cache invalidation",
      "acceptanceCriteria": [
        "Clicking the 'Click Me' button in the Music tab triggers a call to the backend addCCoins function with the value 999999999",
        "After the call succeeds, the C Coins balance in the Store tab updates to reflect the added coins without requiring a manual page refresh",
        "The neon success message ('Infinite C Coins Unlocked!' or equivalent) is displayed in the Music tab after a successful click",
        "The getCCoins query cache is invalidated or refetched on successful addCCoins mutation so the Store tab's balance display is in sync",
        "No console errors are thrown during the button click flow"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/tabs/MusicTab.tsx",
          "operation": "modify",
          "description": "Fix the hidden Click Me button's onClick handler to properly call the addCCoins mutation with 999999999. Ensure the mutation is awaited and on success displays a neon success message. Verify the useAddCCoins hook is correctly imported and invoked at the component level (not inside the handler). The mutation should automatically invalidate the getCCoins query cache on success per the hook's onSuccess callback."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and ensure the useAddCCoins mutation hook includes an onSuccess callback that invalidates the 'ccoins' query key using queryClient.invalidateQueries(['ccoins']). This ensures that when addCCoins succeeds, any components displaying the C Coins balance (like StoreTab) will automatically refetch and display the updated balance."
        }
      ]
    }
  ]
}